/**
 * 问题描述:
 * 
 * 输入一个n行m列的整数矩阵，再输入q个询问，每个询问包含四个整数 x1,y1,x2,y2,表示一个子矩阵的左上角坐标和右下角坐标。
 * 
 * 
 * 数据范围：
 * 1≤n,m≤1000,1≤q≤200000,1≤x1≤x2≤n,1≤y1≤y2≤m,−1000≤矩阵内元素的值≤1000
 */

//s[i, j] = 第i行j列格子左上部分所有元素的和
//以(x1, y1)为左上角，(x2, y2)为右下角的子矩阵的和为：
//s[x2, y2] - s[x1 - 1, y2] - s[x2, y1 - 1] + s[x1 - 1, y1 - 1]

#include<cstdio>

const int N = 1e3+10;
int a[N][N], s[N][N];//a是原矩阵，s是前缀和矩阵

int main(){
  int n,m,q;
  scanf("%d%d%d",&n,&m,&q);
  for(int i=1;i<=n;i++){
    for(int j=1;j<=m;j++){
      scanf("%d",&a[i][j]);
      //预处理: i,j = 左+上-左上
      s[i][j] = s[i-1][j] + s[i][j-1] - s[i-1][j-1] + a[i][j];
    }
  }
  //处理每个查询
  while(q--){
    int x1,y1,x2,y2;
    scanf("%d%d%d%d",&x1,&y1,&x2,&y2);
    //容斥原理：画图理解
    printf("%d\n",s[x2][y2]-s[x1-1][y2]-s[x2][y1-1]+s[x1-1][y1-1]);
  }
}
